#pragma once
#include "Shape.hpp"

//Player2请根据TODO提示补全此类
//完成结果不得与示例相同
//示例：
//输入：s调用Print结果为：
//
//            *
//           ***
//          *****
//         *******
//          *****
//           ***
//            *
//
//
//输出：m_shape调用Print结果为：
//##############################
//############*#################
//###########***################
//##########*****###############
//#########*******##############
//##########*****###############
//###########***################
//############*#################
//##############################
//##############################

class BGCreator
{
public:
	//TODO:将输入的Shape利用'#'补全背景
	//选做：利用base实现不同的基底符号
	Shape Get(Shape s, char base = '#') {
		for (int i = 0; i < ShapeHeight; i++) {
			for (int j = 0; j < ShapeWidth; j++) {
				if (s.Get(j, i) == 0) {
					s.Set(j, i, base);
				}
			}
		}

		return s;
	};
};